hurrican/wita-acceptance-test/src/citrus/resources/templates/cdm/v1/TAL_RUFNUMMERNEXPORT_REX_MK_02/ABM.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--Note: This file is generated by CDM transformation tool - do not modify this file manually!-->
<SOAP-ENV:Envelope
    xmlns="http://www.mnet.de/esb/cdm/SupplierPartner/LineOrderNotificationService/v1" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <notifyUpdateOrder>
            <order>
                <geschaeftsfall>REX-MK</geschaeftsfall>
                <aenderungsKennzeichen>Standard</aenderungsKennzeichen>
                <geschaeftsfallart>Anbieterwechsel</geschaeftsfallart>
            </order>
            <message>
                <ABM>
                    <meldungsattribute>
                        <externeAuftragsnummer>${externalOrderId}</externeAuftragsnummer>
                        <kundennummer>${customerId}</kundennummer>
                        <kundennummerBesteller>${3rdPartySalesmanCustomerId}</kundennummerBesteller>
                        <verbindlicherLiefertermin>${deliveryDate}</verbindlicherLiefertermin>
                        <produktpositionen>
                            <position>
                                <aktionscode>Z</aktionscode>
                                <produkt>
                                    <kategorie>TAL</kategorie>
                                    <bezeichner>Rufnummernmitnahme Durchwahlrufnummer</bezeichner>
                                </produkt>
                            </position>
                        </produktpositionen>
                        <TAL>
                            <vertragsnummer>${contractId}</vertragsnummer>
                            <leitung>
                                <leitungsbezeichnung>
                                    <leitungsschluesselzahl>52B</leitungsschluesselzahl>
                                    <onkzA>89</onkzA>
                                    <onkzB>89</onkzB>
                                    <ordnungsnummer>1000000000</ordnungsnummer>
                                </leitungsbezeichnung>
                            </leitung>
                            <rnrPortierung>
                                <portierungRufnummernbloecke>
                                    <onkzDurchwahlAbfragestelle>
                                    <ONKZ>4401</ONKZ>
                                    <durchwahlnummer>9601</durchwahlnummer>
                                    <abfragestelle>0</abfragestelle>
                                    </onkzDurchwahlAbfragestelle>
                                    <zuPortierenderRufnummernblock>
                                    <rnrBlockVon>000</rnrBlockVon>
                                    <rnrBlockBis>199</rnrBlockBis>
                                    </zuPortierenderRufnummernblock>
                                    <zuPortierenderRufnummernblock>
                                    <rnrBlockVon>200</rnrBlockVon>
                                    <rnrBlockBis>699</rnrBlockBis>
                                    </zuPortierenderRufnummernblock>
                                    <zuPortierenderRufnummernblock>
                                    <rnrBlockVon>700</rnrBlockVon>
                                    <rnrBlockBis>999</rnrBlockBis>
                                    </zuPortierenderRufnummernblock>
                                </portierungRufnummernbloecke>
                            </rnrPortierung>
                        </TAL>
                    </meldungsattribute>
                    <meldungspositionen>
                        <position>
                            <meldungscode>0000</meldungscode>
                            <meldungstext>keine Änderung zum Auftrag</meldungstext>
                            <positionsattribute>
                                <ansprechpartnerTelekom>
                                    <anrede>1</anrede>
                                    <vorname>Steve</vorname>
                                    <nachname>Vollmann</nachname>
                                    <telefonnummer>1682076651</telefonnummer>
                                    <emailadresse>sv@web.de</emailadresse>
                                </ansprechpartnerTelekom>
                            </positionsattribute>
                        </position>
                    </meldungspositionen>
                </ABM>
            </message>
            <captured>citrus:currentDate(yyyy-MM-dd'T'HH:mm:ss)</captured>
        </notifyUpdateOrder>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
